In [ ]:
'''Series are a couple of elements kinda like the dictionary'''

In [2]:
import pandas as pd
import numpy as np

In [ ]:
#create a series that means create a sequence of numbers where each one is assigned by the index
obj = pd.Series([3,7,5,8])
print(obj) #first column is the index column, while the second is for the vaues

0    3
1    7
2    5
3    8
dtype: int64

In [5]:
#let's have just the column value as output and then just the index column
print(obj.values)
print(obj.index)

[3 7 5 8]
RangeIndex(start=0, stop=4, step=1)

In [9]:
#Actually i can change also the index column as i want, but for default the system just give you the sort numbers from 0 to n-1

obj2 = pd.Series([3,6,8,2], index=(['a','b','c','d']))
print(obj2)

a    3
b    6
c    8
d    2
dtype: int64

In [10]:
#to find the value based on the index:
obj2['c']

np.int64(8)

In [11]:
#Lets change the value of the index d
obj2['d'] = 17
obj2['d']

np.int64(17)

In [15]:
#lets try the slicing
obj2['b':'c']

b    6
c    8
dtype: int64

In [21]:
#if a use the '>' or '<' it will return the boolean array
obj2 <=6

a     True
b     True
c    False
d    False
dtype: bool

In [22]:
#if i put the condition inside the square brackets it will return the Series with the elements that satisfy the condition
obj2[obj2 <= 6]

a    3
b    6
dtype: int64

In [ ]:
#check if a index is in the Series
'l' in obj2 #or l in obj2 also in this case will research inside the indexs

False

In [ ]:
#check if it is in the values
3 in obj2.values
#obj2.isin([6]) another way that return a boolean array
#obj2 == 2 same of the last comment

True

In [42]:
#sum is used for sum the '1' in the boolean array
#all is used for seeing if the condition is satisfy by all elements
#any is usef for seeing if the condition is satisfy
print(obj2)
print((obj2 == 3).any())
print((obj2 == 3).all())
print((obj2 == 3).sum())

a     3
b     6
c     8
d    17
dtype: int64
True
False
1

In [45]:
#To do the addition between two series we can not do the simple plus
#because the system usually check the index and sum just the elements 
#with the same index while the other will turn into NaN
#to avoid this we need to use the function add

obj3 = pd.Series([3, 7, 10, 6 ], index=['a','b','c','d'])

obj4 = pd.Series([3, 7, 10, 6 ], index=['a','b','l','d'])
print(obj3.add(obj4, fill_value=0))

a     6.0
b    14.0
c    10.0
d    12.0
l    10.0
dtype: float64

In [ ]:
#to pass from Series to dict
obj4.to_dict()

{'a': 3, 'b': 7, 'l': 10, 'd': 6}

In [52]:
#To pass from dict to series it needed to put as argument the dict
obj5 = pd.Series(obj4)
obj5

a     3
b     7
l    10
d     6
dtype: int64

In [53]:
#check null
pd.isnull(obj5)

a    False
b    False
l    False
d    False
dtype: bool

Dropping method

In [55]:
#To drop one of the elements
obj7 = pd.Series(np.arange(5.),index=['a','b','c','d','e'])
obj7

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [ ]:
obj7.drop('c', inplace=True)
#or obj7 = obj7.drop('c') do it like this make sure that elements is deleted

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

NAMES

In [59]:
#give the name for index and for values
obj7.name = 'Numbers'
obj7.index.name = 'Letters'

In [60]:
obj7

Letters
a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
Name: Numbers, dtype: float64

Exercise random

In [61]:
fruits_week = pd.Series([10,20,30,40,50,60,70], index=['mo','th','we','thu','fri','sat','sun'])
#select the quantity of fruit sell on saturday
fruits_week['sat']

np.int64(60)

In [84]:
#find the sum of quantity during the weekend
fruits_week['fri':].sum()

fruits_week[-3:].sum()

np.int64(180)

In [86]:
#how many days the quantity is higher than 30
(fruits_week > 30).sum()

np.int64(4)

DataFrame

In [90]:
'''We can see Dataframe as a collection of series where every column and every row
is a series.
To inizialize a DataFrame we can used a dict'''
data = {'State': ['ohio', 'ohio', 'ohio', 'Nevada'],
        'years': [2000, 2001, 2002, 2003],
        'pop' : [1.3, 1.2, 3.4, 6]
        }
frame = pd.DataFrame(data)
frame

    State  years  pop
0    ohio   2000  1.3
1    ohio   2001  1.2
2    ohio   2002  3.4
3  Nevada   2003  6.0

In [93]:
frame.shape
frame.shape[0] #number of row
frame.shape[1] #number of column

3

In [94]:
#first rows
frame.head(2)

  State  years  pop
0  ohio   2000  1.3
1  ohio   2001  1.2

In [95]:
#last rows
frame.tail(2)

    State  years  pop
2    ohio   2002  3.4
3  Nevada   2003  6.0

In [96]:
#random lines in frame
frame.sample()

    State  years  pop
3  Nevada   2003  6.0

In [ ]:
#knowing the name of columns

frame.columns

Index(['State', 'years', 'pop'], dtype='object')

In [98]:
#choose column
frame['years']

0    2000
1    2001
2    2002
3    2003
Name: years, dtype: int64

In [99]:
#given that a column is a series 
frame.index.values

array([0, 1, 2, 3])

In [103]:
frame1 = pd.DataFrame(data, index=np.arange(4,8))
frame1

    State  years  pop
4    ohio   2000  1.3
5    ohio   2001  1.2
6    ohio   2002  3.4
7  Nevada   2003  6.0

In [106]:
frame1.index = ['uno','due','tre','quattro']
frame1

          State  years  pop
uno        ohio   2000  1.3
due        ohio   2001  1.2
tre        ohio   2002  3.4
quattro  Nevada   2003  6.0

In [108]:
frame1.State

uno          ohio
due          ohio
tre          ohio
quattro    Nevada
Name: State, dtype: object

In [113]:
#get the second value of the column State

frame1['State'][1]

C:\Users\halima\AppData\Local\Temp\ipykernel_22764\4042132094.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  frame1['State'][1]

'ohio'